zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_clock.c
/*
 * Copyright 2017-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_clock.h"
#include "fsl_power.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

/** External clock rate on the CLKIN pin in Hz. If not used,
    set this to 0. Otherwise, set it to the exact rate in Hz this pin is
    being driven at. */
static uint32_t s_Ext_Clk_Freq = 32000000U;
static uint32_t s_PLU_ClkIn_Freq = 0U;

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/* Clock Selection for IP */
/**
 * brief   Configure the clock selection muxes.
 * param   connection  : Clock to be configured.
 * return  Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection)
{
    uint8_t mux;
    uint32_t sel;
    uint16_t item;
    uint32_t i;

    if (connection != kNONE_to_NONE)
    {
        for (i = 0U; i < 2U; i++)
        {
            if (connection == 0U)
            {
                break;
            }
            item = (uint16_t)GET_ID_ITEM(connection);
            if (item)
            {
                mux = GET_ID_ITEM_MUX(item);
                sel = GET_ID_ITEM_SEL(item);

                switch (mux)
                {
                    case CM_RTCOSC32KCLKSEL:
                      PMC->RTCOSC32K |= sel;
                      break;
                    case CM_MAINCLKSELB:
                      SYSCON->MAINCLKSELB = sel;
                      break;
                    case CM_MAINCLKSELA:
                      SYSCON->MAINCLKSELA = sel;
                      break;
                    case CM_CLKOUTCLKSEL:
                      SYSCON->CLKOUTSEL = sel;
                      break;
                    case CM_FXCOMCLKSEL0:
                      SYSCON->FCCLKSELX[0] = sel;
                      break;
                    case CM_FXCOMCLKSEL1:
                      SYSCON->FCCLKSELX[1] = sel;
                      break;
                    case CM_FXCOMCLKSEL2:
                      SYSCON->FCCLKSELX[2] = sel;
                      break;
                    case CM_SCTCLKSEL:
                      SYSCON->SCTCLKSEL = sel;
                      break;
                    case CM_TRACECLKSEL:
                      SYSCON->TRACECLKSEL = sel;
                      break;
                    case CM_SYSTICKCLKSEL:
                      SYSCON->SYSTICKCLKSELX[0] = sel;
                      break;
                    case CM_CTIMERCLKSEL0:
                      SYSCON->CTIMERCLKSELX[0] = sel;
                      break;
                    case CM_CTIMERCLKSEL1:
                      SYSCON->CTIMERCLKSELX[1] = sel;
                      break;
                    case CM_CTIMERCLKSEL2:
                      SYSCON->CTIMERCLKSELX[2] = sel;
                      break;
                    case CM_CTIMERCLKSEL3:
                      SYSCON->CTIMERCLKSELX[3] = sel;
                      break;
                    case CM_CTIMERCLKSEL4:
                      SYSCON->CTIMERCLKSELX[4] = sel;
                      break;
                    case CM_SPIFICLKSEL:
                      SYSCON->SPIFICLKSEL = sel;
                      break;
                    default:
                      break;
                }
            }
            connection = GET_ID_NEXT_ITEM(connection); /* pick up next descriptor */
        }
    }
}

/**
 * brief   Validate the attachID.
 * This fuction checks the attachId to see if it is valid.
 * param   attachId  : Clock attach id to get.
 * return  true   : the attachId is valid..
 *         false  : the attachId is out of range.
 */
static bool CLOCK_CheckAttachId(clock_attach_id_t attachId)
{
    bool ret = false;

    switch (attachId)
    {
        case kFRO12M_to_MAIN_CLK:
        case kEXT_CLK_to_MAIN_CLK:
        case kFRO1M_to_MAIN_CLK:
        case kFRO_HF_to_MAIN_CLK:
        case kFRO24M_to_MAIN_CLK:
        case kOSC32K_to_MAIN_CLK:
        case kMAIN_CLK_to_CLKOUT:
        case kEXT_CLK_to_CLKOUT:
        case kFRO_HF_to_CLKOUT:
        case kFRO1M_to_CLKOUT:
        case kFRO24M_to_CLKOUT:
        case kOSC32K_to_CLKOUT:
        case kNONE_to_SYS_CLKOUT:
        case kMAIN_CLK_to_FLEXCOMM0:
        case kFRO12M_to_FLEXCOMM0:
        case kFRO_HF_DIV_to_FLEXCOMM0:
        case kFRO1M_to_FLEXCOMM0:
        case kFRO24M_to_FLEXCOMM0:
        case kOSC32K_to_FLEXCOMM0:
        case kNONE_to_FLEXCOMM0:
        case kMAIN_CLK_to_FLEXCOMM1:
        case kFRO12M_to_FLEXCOMM1:
        case kFRO_HF_DIV_to_FLEXCOMM1:
        case kFRO1M_to_FLEXCOMM1:
        case kFRO24M_to_FLEXCOMM1:
        case kOSC32K_to_FLEXCOMM1:
        case kNONE_to_FLEXCOMM1:
        case kMAIN_CLK_to_FLEXCOMM2:
        case kFRO12M_to_FLEXCOMM2:
        case kFRO_HF_DIV_to_FLEXCOMM2:
        case kFRO1M_to_FLEXCOMM2:
        case kFRO24M_to_FLEXCOMM2:
        case kOSC32K_to_FLEXCOMM2:
        case kNONE_to_FLEXCOMM2:
        case kMAIN_CLK_to_SCT_CLK:
        case kEXT_CLK_to_SCT_CLK:
        case kFRO_HF_to_SCT_CLK:
        case kFRO24M_to_SCT_CLK:
        case kNONE_to_SCT_CLK:
        case kFRO32K_to_OSC32K:
        case kXTAL32K_to_OSC32K:
        case kTRACE_DIV_to_TRACE:
        case kFRO1M_to_TRACE:
        case kOSC32K_to_TRACE:
        case kNONE_to_TRACE:
        case kSYSTICK_DIV_to_SYSTICK:
        case kFRO1M_to_SYSTICK:
        case kOSC32K_to_SYSTICK:
        case kNONE_to_SYSTICK:
        case kMAIN_CLK_to_CTIMER0:
        case kFRO_HF_to_CTIMER0:
        case kFRO1M_to_CTIMER0:
        case kFRO24M_to_CTIMER0:
        case kOSC32K_to_CTIMER0:
        case kNONE_to_CTIMER0:
        case kMAIN_CLK_to_CTIMER1:
        case kFRO_HF_to_CTIMER1:
        case kFRO1M_to_CTIMER1:
        case kFRO24M_to_CTIMER1:
        case kOSC32K_to_CTIMER1:
        case kNONE_to_CTIMER1:
        case kMAIN_CLK_to_CTIMER2:
        case kFRO_HF_to_CTIMER2:
        case kFRO1M_to_CTIMER2:
        case kFRO24M_to_CTIMER2:
        case kOSC32K_to_CTIMER2:
        case kNONE_to_CTIMER2:
        case kMAIN_CLK_to_CTIMER3:
        case kFRO_HF_to_CTIMER3:
        case kFRO1M_to_CTIMER3:
        case kFRO24M_to_CTIMER3:
        case kOSC32K_to_CTIMER3:
        case kNONE_to_CTIMER3:
        case kMAIN_CLK_to_CTIMER4:
        case kFRO_HF_to_CTIMER4:
        case kFRO1M_to_CTIMER4:
        case kFRO24M_to_CTIMER4:
        case kOSC32K_to_CTIMER4:
        case kNONE_to_CTIMER4:
        case kMAIN_CLK_to_SPIFI:
        case kFRO64M_to_SPIFI:
        case kFRO_HF_to_SPIFI:
        case kFRO_HF_DIV_to_SPIFI:
        case kFRO48M_to_SPIFI:
        case kNONE_to_NONE:
            ret = true;
            break;
        default:
            ret = false;
            break;
    }

    return ret;
}

/* Return the actual clock attach id */
/**
 * brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * param   attachId  : Clock attach id to get.
 * return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId(clock_attach_id_t attachId)
{
    uint8_t mux;
    uint32_t actualSel = 0;
    uint32_t i;
    clock_attach_id_t actualAttachId = kNONE_to_NONE;
    uint32_t selector;

    if (attachId == kNONE_to_NONE)
    {
        return kNONE_to_NONE;
    }

    if (CLOCK_CheckAttachId(attachId))
    {
        selector = GET_ID_SELECTOR(attachId);
    }
    else
    {
        return kNONE_to_NONE;
    }

