zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_clock.c
    for (i = 0U; i < 2U; i++)
    {
        mux = GET_ID_ITEM_MUX(attachId);
        if (attachId)
        {
            switch (mux)
            {
                case CM_RTCOSC32KCLKSEL:
                  actualSel = PMC->RTCOSC32K;
                  break;
                case CM_MAINCLKSELB:
                  actualSel = SYSCON->MAINCLKSELB;
                  break;
                case CM_MAINCLKSELA:
                  actualSel = SYSCON->MAINCLKSELA;
                  break;
                case CM_CLKOUTCLKSEL:
                  actualSel = SYSCON->CLKOUTSEL;
                  break;
                case CM_FXCOMCLKSEL0:
                  actualSel = SYSCON->FCCLKSELX[0];
                  break;
                case CM_FXCOMCLKSEL1:
                  actualSel = SYSCON->FCCLKSELX[1];
                  break;
                case CM_FXCOMCLKSEL2:
                  actualSel = SYSCON->FCCLKSELX[2];
                  break;
                case CM_SCTCLKSEL:
                  actualSel = SYSCON->SCTCLKSEL;
                  break;
                case CM_TRACECLKSEL:
                  actualSel = SYSCON->TRACECLKSEL;
                  break;
                case CM_SYSTICKCLKSEL:
                  actualSel = SYSCON->SYSTICKCLKSELX[0];
                  break;
                case CM_CTIMERCLKSEL0:
                  actualSel = SYSCON->CTIMERCLKSELX[0];
                  break;
                case CM_CTIMERCLKSEL1:
                  actualSel = SYSCON->CTIMERCLKSELX[1];
                  break;
                case CM_CTIMERCLKSEL2:
                  actualSel = SYSCON->CTIMERCLKSELX[2];
                  break;
                case CM_CTIMERCLKSEL3:
                  actualSel = SYSCON->CTIMERCLKSELX[3];
                  break;
                case CM_CTIMERCLKSEL4:
                  actualSel = SYSCON->CTIMERCLKSELX[4];
                  break;
                case CM_SPIFICLKSEL:
                  actualSel = SYSCON->SPIFICLKSEL;
                  break;
                default:
                  break;
            }

            if (actualSel >= UINT32_MAX)
            {
                return kNONE_to_NONE;
            }
            /* Consider the combination of two registers */
            actualAttachId |= CLK_ATTACH_ID(mux, actualSel, i);
        }
        attachId = GET_ID_NEXT_ITEM(attachId); /* pick up next descriptor */
    }

    actualAttachId |= selector;

    return actualAttachId;
}

/* Set IP Clock Divider */
/**
 * brief   Setup peripheral clock dividers.
 * param   div_name    : Clock divider name
 * param divided_by_value: Value to be divided
 * param reset :  Whether to reset the divider counter.
 * return  Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset)
{
    volatile uint32_t *pClkDiv;

    if (div_name > kCLOCK_DivMax)
    {
        return;
    }

    switch (div_name)
    {
        case kCLOCK_DivSystickClk:
            pClkDiv = &(SYSCON->SYSTICKCLKDIV0);
            break;
        case kCLOCK_DivArmTrClkDiv:
            pClkDiv = &(SYSCON->TRACECLKDIV);
            break;
        case kCLOCK_DivFlexFrg0:
            pClkDiv = &(SYSCON->FLEXFRGCTRL.FLEXFRG0CTRL);
            break;
        case kCLOCK_DivFlexFrg1:
            pClkDiv = &(SYSCON->FLEXFRGCTRL.FLEXFRG1CTRL);
            break;
        case kCLOCK_DivFlexFrg2:
            pClkDiv = &(SYSCON->FLEXFRGCTRL.FLEXFRG2CTRL);
            break;
        case kCLOCK_DivAhbClk:
            pClkDiv = &(SYSCON->AHBCLKDIV);
            break;
        case kCLOCK_DivClkOut:
            pClkDiv = &(SYSCON->CLKOUTDIV);
            break;
        case kCLOCK_DivFrohfClk:
            pClkDiv = &(SYSCON->FROHFDIV);
            break;
        case kCLOCK_DivWdtClk:
            pClkDiv = &(SYSCON->WDTCLKDIV);
            break;
        case kCLOCK_DivSctClk:
            pClkDiv = &(SYSCON->SCTCLKDIV);
            break;
        case kCLOCK_DivSpifiClk:
            pClkDiv = &(SYSCON->SPIFICLKDIV);
            break;
        default:
            return;
            break;
    }

    if (reset)
    {
        *pClkDiv = 1U << 29U;
    }
    if (divided_by_value == 0U) /* halt */
    {
        *pClkDiv = 1U << 30U;
    }
    else
    {
        *pClkDiv = (divided_by_value - 1U);
    }

    __ISB();
    __DSB();
}

/* Set RTC 1KHz Clock Divider */
/**
 * brief   Setup rtc 1khz clock divider.
 * param divided_by_value: Value to be divided
 * return  Nothing
 */
void CLOCK_SetRtc1khzClkDiv(uint32_t divided_by_value)
{
    uint32_t rtcOsk32K = PMC->RTCOSC32K & ~(PMC_RTCOSC32K_CLK1KHZDIV_MASK);

    if (divided_by_value < 28U)
    {
        return;
    }

    PMC->RTCOSC32K     = rtcOsk32K | ((divided_by_value - 28U) << PMC_RTCOSC32K_CLK1KHZDIV_SHIFT);
}

/* Set RTC 1KHz Clock Divider */
/**
 * brief   Setup rtc 1hz clock divider.
 * param divided_by_value: Value to be divided
 * return  Nothing
 */
void CLOCK_SetRtc1hzClkDiv(uint32_t divided_by_value)
{
    if (divided_by_value == 0U) /* halt */
    {
        PMC->RTCOSC32K |= (1U << PMC_RTCOSC32K_CLK1HZDIVHALT_SHIFT);
    }
    else
    {
        uint32_t rtcOsk32K = PMC->RTCOSC32K & ~(PMC_RTCOSC32K_CLK1HZDIV_MASK);
        PMC->RTCOSC32K     = rtcOsk32K | ((divided_by_value - 31744U) << PMC_RTCOSC32K_CLK1HZDIV_SHIFT);
    }
}

void CLOCK_Enable1MFRO(bool enable)
{
    if (enable)
    {
        SYSCON->CLOCK_CTRL |= 1UL << SYSCON_CLOCK_CTRL_FRO1MHZ_CLK_ENA_SHIFT;
        SYSCON->CLOCK_CTRL |= 1UL << SYSCON_CLOCK_CTRL_FRO1MHZ_UTICK_ENA_SHIFT;
    }
    else
    {
        SYSCON->CLOCK_CTRL &= ~(1UL << SYSCON_CLOCK_CTRL_FRO1MHZ_UTICK_ENA_SHIFT);
        SYSCON->CLOCK_CTRL &= ~(1UL << SYSCON_CLOCK_CTRL_FRO1MHZ_CLK_ENA_SHIFT);
    }
}

/* Set FRO Clocking */
status_t CLOCK_SetupFROClocking(uint32_t iFreq)
{
    switch (iFreq)
    {
        case kFreq_12MHz:
            ANACTRL->FRO192M_CTRL |= ANACTRL_FRO192M_CTRL_ENA_12MHZCLK(1);
            CLOCK_AttachClk(kFRO12M_to_MAIN_CLK);
            break;
        case kFreq_24MHz:
            ANACTRL->FRO192M_CTRL |= ANACTRL_FRO192M_CTRL_ENA_24MHZCLK(1);
            CLOCK_AttachClk(kFRO24M_to_MAIN_CLK);
            break;
        case kFreq_32MHz:
            ANACTRL->FRO192M_CTRL |= ANACTRL_FRO192M_CTRL_ENA_32MHZCLK(1);
            CLOCK_AttachClk(kFRO_HF_to_MAIN_CLK);
            break;
        case kFreq_48MHz:
            ANACTRL->FRO192M_CTRL |= ANACTRL_FRO192M_CTRL_ENA_48MHZCLK(1);
            /* This FRO cannot be used as main clock */
            break;
        case kFreq_64MHz:
            ANACTRL->FRO192M_CTRL |= ANACTRL_FRO192M_CTRL_ENA_64MHZCLK(1);
            /* This FRO cannot be used as main clock */
            break;
        default:
            return kStatus_Fail;
            break;
    }
    __ISB();
    __DSB();

    return kStatus_Success;
}

/* Disable FRO */
status_t CLOCK_DisableFROClock(uint32_t iFreq)
{
    switch (iFreq)
    {
        case kFreq_12MHz:
            ANACTRL->FRO192M_CTRL &= ~(ANACTRL_FRO192M_CTRL_ENA_12MHZCLK(1));
            break;
        case kFreq_24MHz:
            ANACTRL->FRO192M_CTRL &= ~(ANACTRL_FRO192M_CTRL_ENA_24MHZCLK(1));
            break;
        case kFreq_32MHz:
            ANACTRL->FRO192M_CTRL &= ~(ANACTRL_FRO192M_CTRL_ENA_32MHZCLK(1));
            break;
        case kFreq_48MHz:
            ANACTRL->FRO192M_CTRL &= ~(ANACTRL_FRO192M_CTRL_ENA_48MHZCLK(1));
            break;
        case kFreq_64MHz:
            ANACTRL->FRO192M_CTRL &= ~(ANACTRL_FRO192M_CTRL_ENA_64MHZCLK(1));
            break;
        default:
            return kStatus_Fail;
            break;
    }
    __ISB();
    __DSB();

    return kStatus_Success;
}

/* Set the FLASH wait states for the passed frequency */
/**
 * brief	Set the flash wait states for the input freuqency.
 * param	iFreq	: Input frequency in Hz
 * return	Nothing
 */
void CLOCK_SetFLASHAccessCyclesForFreq(uint32_t iFreq)
{
    uint32_t flashControl;
    uint32_t numExtraWaitStates = 0;

    // We take 10% margin on the 16MHz frequency where we need to switch from 0 to 1
    if (iFreq >= 14400000)
    {
        numExtraWaitStates = 1;
    }

