zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_clock.c
    flashControl = FMU0->FCTRL & ~(FMU_FCTRL_RWSC_MASK);

    FMU0->FCTRL = flashControl | (numExtraWaitStates << FMU_FCTRL_RWSC_SHIFT);
}

/**
 * brief	Get the actual flash wait states.
 * return	ReadWaitStates
 */
uint32_t CLOCK_GetFLASHAccessCycles(void)
{
    return (FMU0->FCTRL & FMU_FCTRL_RWSC_MASK) >> FMU_FCTRL_RWSC_SHIFT;
}

/**
 * brief	Set the flash wait states.
 * param	ReadWaitStates
 */
void CLOCK_SetFLASHAccessCycles(uint32_t ReadWaitStates)
{
    uint32_t flash_control = FMU0->FCTRL & ~(FMU_FCTRL_RWSC_MASK);
    FMU0->FCTRL            = flash_control | (ReadWaitStates << FMU_FCTRL_RWSC_SHIFT);
}

/* Get CLOCK OUT Clk */
uint32_t CLOCK_GetClockOutClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->CLKOUTSEL)
    {
        case CLKOUTSEL_MAINCLK:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case CLKOUTSEL_CLKIN:
            freq = CLOCK_GetExtClkFreq();
            break;

        case CLKOUTSEL_FRO_32MHz:
            freq = CLOCK_GetFroHfFreq();
            break;

        case CLKOUTSEL_FRO_1MHz:
            freq = CLOCK_GetFro1MFreq();
            break;

        case CLKOUTSEL_FRO_24MHz:
            freq = CLOCK_GetFro24MFreq();
            break;

        case CLKOUTSEL_32K_OSC:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            // All other values mean NO_CLOCK
            freq = 0;
            break;
    }
    return freq / ((SYSCON->CLKOUTDIV & SYSCON_CLKOUTDIV_DIV_MASK) + 1U);
}

/* Get SCTIMER Clk */
uint32_t CLOCK_GetSctClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->SCTCLKSEL)
    {
        case SCTCLKSEL_MAINCLK:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case SCTCLKSEL_NO_CLOCK:
            freq = 0;
            break;

        case SCTCLKSEL_CLKIN:
            freq = CLOCK_GetExtClkFreq();
            break;

        case SCTCLKSEL_FRO_32MHz:
            freq = CLOCK_GetFroHfFreq();
            break;

        default:
            // All other values mean FRO_24MHz
            freq = CLOCK_GetFro24MFreq();
            break;
    }

    return freq / ((SYSCON->SCTCLKDIV & SYSCON_SCTCLKDIV_DIV_MASK) + 1U);
}

/* Get FRO 12M Clk */
uint32_t CLOCK_GetFro12MFreq(void)
{
    return (PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) ?
               0 :
               (ANACTRL->FRO192M_CTRL & ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_MASK) ? kFreq_12MHz : 0U;
}

/* Get FRO 24M Clk */
uint32_t CLOCK_GetFro24MFreq(void)
{
    return (PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) ?
               0 :
               (ANACTRL->FRO192M_CTRL & ANACTRL_FRO192M_CTRL_ENA_24MHZCLK_MASK) ? kFreq_24MHz : 0U;
}

/* Get FRO 24M Clk */
uint32_t CLOCK_GetFro48MFreq(void)
{
    return (PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) ?
               0 :
               (ANACTRL->FRO192M_CTRL & ANACTRL_FRO192M_CTRL_ENA_48MHZCLK_MASK) ? kFreq_48MHz : 0U;
}

/* Get FRO 64M Clk */
uint32_t CLOCK_GetFro64MFreq(void)
{
    return (PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) ?
               0 :
               (ANACTRL->FRO192M_CTRL & ANACTRL_FRO192M_CTRL_ENA_64MHZCLK_MASK) ? kFreq_64MHz : 0U;
}

/* Get FRO 1M Clk */
uint32_t CLOCK_GetFro1MFreq(void)
{
    return (SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_FRO1MHZ_CLK_ENA_MASK) ? kFreq_1MHz : 0U;
}

/* Get EXT OSC Clk */
uint32_t CLOCK_GetExtClkFreq(void)
{
    return (SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK) ? s_Ext_Clk_Freq : 0U;
}

/* Get WATCH DOG Clk */
uint32_t CLOCK_GetWdtClkFreq(void)
{
    return CLOCK_GetFro1MFreq() / ((SYSCON->WDTCLKDIV & SYSCON_WDTCLKDIV_DIV_MASK) + 1U);
}

/* Get HF FRO Clk */
uint32_t CLOCK_GetFroHfFreq(void)
{
    return (PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) ?
               0 :
               (ANACTRL->FRO192M_CTRL & ANACTRL_FRO192M_CTRL_ENA_32MHZCLK_MASK) ? kFreq_32MHz : 0U;
}

/* Get RTC OSC Clk */
uint32_t CLOCK_GetOsc32KFreq(void)
{
    return (((PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO32K_MASK) == 0) &&
            ((PMC->RTCOSC32K & PMC_RTCOSC32K_SEL_MASK) == 0)) ?
               CLK_RTC_32K_CLK :
               /* Disabled check on power as the osc might be off when the clock is supplied externally */
               ((/*((PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_XTAL32K_MASK) == 0) && */
                 ((PMC->RTCOSC32K & PMC_RTCOSC32K_SEL_MASK) != 0)) ?
                    CLK_RTC_32K_CLK :
                    0U);
}

/* Get MAIN Clk */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->MAINCLKSELB)
    {
        case MAINCLKSELB_MAINCLKAOUT:
            switch (SYSCON->MAINCLKSELA)
            {
                case MAINCLKSELA_FRO_12MHz:
                case MAINCLKSELA_FRO_12MHz_ALTERNATE_VALUE1:
                    freq = CLOCK_GetFro12MFreq();
                    break;

                case MAINCLKSELA_FRO_1MHz:
                case MAINCLKSELA_FRO_1MHz_ALTERNATE_VALUE1:
                    freq = CLOCK_GetFro1MFreq();
                    break;

                case MAINCLKSELA_FRO_32MHz:
                case MAINCLKSELA_FRO_32MHz_ALTERNATE_VALUE1:
                    freq = CLOCK_GetFroHfFreq();
                    break;

                case MAINCLKSELA_CLKIN:
                case MAINCLKSELA_CLKIN_ALTERNATE_VALUE1:
                    freq = CLOCK_GetExtClkFreq();
                    break;

                default:
                    break;
            }
            break;

        case MAINCLKSELB_FRO_24MHz:
            freq = CLOCK_GetFro24MFreq();
            break;

        case MAINCLKSELB_32K_OSC:
        case MAINCLKSELB_32K_OSC_ALTERNATE_VALUE1:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            break;
    }

    return freq;
}

/* Get FLEXCOMM input clock */
uint32_t CLOCK_GetFlexCommInputClock(uint32_t id)
{
    uint32_t freq = 0U;

    switch (SYSCON->FCCLKSELX[id])
    {
        case FCCLKSEL_MAINCLK:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

