zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_clock.c
        case FCCLKSEL_FRO_12MHz:
            freq = CLOCK_GetFro12MFreq();
            break;

        case FCCLKSEL_FRO_32MHz_DIV:
            freq = CLOCK_GetFroHfFreq() / ((SYSCON->FROHFDIV & SYSCON_FROHFDIV_DIV_MASK) + 1U);
            break;

        case FCCLKSEL_FRO_1MHz:
            freq = CLOCK_GetFro1MFreq();
            break;

        case FCCLKSEL_FRO_24MHz:
            freq = CLOCK_GetFro24MFreq();
            break;

        case FCCLKSEL_32K_OSC:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            // All other values mean NO_CLOCK
            freq = 0;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetFlexCommClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t frgMul = 0U;
    uint32_t frgDiv = 0U;
    uint64_t result = 0U;

    freq   = CLOCK_GetFlexCommInputClock(id);
    frgMul = (SYSCON->FLEXFRGXCTRL[id] & SYSCON_FLEXFRG0CTRL_MULT_MASK) >> 8U;
    frgDiv = SYSCON->FLEXFRGXCTRL[id] & SYSCON_FLEXFRG0CTRL_DIV_MASK;
    result = ((uint64_t)freq * ((uint64_t)frgDiv + 1ULL)) / (frgMul + frgDiv + 1UL);

    if (result > UINT32_MAX)
    {
        return 0;
    }
    else
    {
        return (uint32_t)result;
    }
}

/* Get SPIFI Clk */
uint32_t CLOCK_GetSpifiClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->SPIFICLKSEL)
    {
        case SPIFICLKSEL_MAINCLK:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case SPIFICLKSEL_FRO_64MHz:
            freq = CLOCK_GetFro64MFreq();
            break;

        case SPIFICLKSEL_FRO_32MHz:
            freq = CLOCK_GetFroHfFreq();
            break;

        case SPIFICLKSEL_FRO_32MHz_DIV:
            freq = CLOCK_GetFroHfFreq() / ((SYSCON->FROHFDIV & SYSCON_FROHFDIV_DIV_MASK) + 1U);
            break;

        default:
            // All other values mean FRO_48MHz
            freq = CLOCK_GetFro48MFreq();
            break;
    }

    return freq;
}

/* Get CTimer Clk */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    switch (SYSCON->CTIMERCLKSELX[id])
    {
        case CTIMERCLKSEL_MAINCLK:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case CTIMERCLKSEL_FRO_32MHz:
            freq = CLOCK_GetFroHfFreq();
            break;

        case CTIMERCLKSEL_FRO_1MHz:
            freq = CLOCK_GetFro1MFreq();
            break;

        case CTIMERCLKSEL_FRO_24MHz:
            freq = CLOCK_GetFro24MFreq();
            break;

        case CTIMERCLKSEL_32K_OSC:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            // All other values mean NO_CLOCK
            freq = 0;
            break;
    }

    return freq;
}

/* Get Systick Clk */
uint32_t CLOCK_GetSystickClkFreq(uint32_t id)
{
    volatile uint32_t *pSystickClkDiv;

    pSystickClkDiv = &(SYSCON->SYSTICKCLKDIV0);
    uint32_t freq  = 0U;

    if (id >= SYSCON_SYSTICKCLKSEL_SYSTICKCLKSELX_SYSTICKCLKSELX_COUNT)
    {
        return 0;
    }

    switch ((uint32_t)(SYSCON->SYSTICKCLKSELX[id]))
    {
        case SYSTICKCLKSEL_SYSTICK_DIV:
            freq = CLOCK_GetCoreSysClkFreq() / ((pSystickClkDiv[id] & SYSCON_SYSTICKCLKDIV0_DIV_MASK) + 1U);
            break;

        case SYSTICKCLKSEL_FRO_1MHz:
            freq = CLOCK_GetFro1MFreq();
            break;

        case SYSTICKCLKSEL_32K_OSC:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            // All other values mean NO_CLOCK
            freq = 0;
            break;
    }

    return freq;
}

/* Set FlexComm Clock */
uint32_t CLOCK_SetFlexCommClock(uint32_t id, uint32_t freq)
{
    uint32_t input = CLOCK_GetFlexCommClkFreq(id);
    uint32_t mul;
    uint64_t temp;

    /* Check for division by zero */
    if (0U == freq)
    {
        return 0;
    }

    temp = ((uint64_t)(input - freq) * 256U) / ((uint64_t)freq);

    if ((freq > kFreq_32MHz) || (freq > input) || (input / freq >= 2))
    {
        /* FRG output frequency should be less than equal to 32MHz */
        return 0;
    }
    else
    {
        if (temp > UINT32_MAX)
        {
            /* Overflow, cannot safely assign to uint32_t */
            return 0;
        }
        else
        {
            mul = (uint32_t)temp;
            SYSCON->FLEXFRGXCTRL[id] = (mul << 8U) | 0xFFU;
            return 1;
        }
    }
}

/* Get IP Clk */
uint32_t CLOCK_GetFreq(clock_name_t clockName)
{
    uint32_t freq;
    switch (clockName)
    {
        case kCLOCK_CoreSysClk:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) + 1U);
            break;
        case kCLOCK_BusClk:
            freq = CLOCK_GetCoreSysClkFreq() / ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) + 1U);
            break;
        case kCLOCK_ClockOut:
            freq = CLOCK_GetClockOutClkFreq();
            break;
        case kCLOCK_FroHf:
            freq = CLOCK_GetFroHfFreq();
            break;
        case kCLOCK_Fro12M:
            freq = CLOCK_GetFro12MFreq();
            break;
        case kCLOCK_Fro24M:
            freq = CLOCK_GetFro24MFreq();
            break;
        case kCLOCK_ExtClk:
            freq = CLOCK_GetExtClkFreq();
            break;
        case kCLOCK_WdtClk:
            freq = CLOCK_GetWdtClkFreq();
            break;
        case kCLOCK_Sct:
            freq = CLOCK_GetSctClkFreq();
            break;
        case kCLOCK_Flexcomm0:
            freq = CLOCK_GetFlexCommClkFreq(0U);
            break;
        case kCLOCK_Flexcomm1:
            freq = CLOCK_GetFlexCommClkFreq(1U);
            break;
        case kCLOCK_Flexcomm2:
            freq = CLOCK_GetFlexCommClkFreq(2U);
            break;
        case kCLOCK_CTimer0:
            freq = CLOCK_GetCTimerClkFreq(0U);
            break;
        case kCLOCK_CTimer1:
            freq = CLOCK_GetCTimerClkFreq(1U);
            break;
        case kCLOCK_CTimer2:
            freq = CLOCK_GetCTimerClkFreq(2U);
            break;
        case kCLOCK_CTimer3:
            freq = CLOCK_GetCTimerClkFreq(3U);
            break;
        case kCLOCK_CTimer4:
            freq = CLOCK_GetCTimerClkFreq(4U);
            break;
        case kCLOCK_Systick:
            freq = CLOCK_GetSystickClkFreq(0U);
            break;
        case kCLOCK_SpifiClk:
            freq = CLOCK_GetSpifiClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/* Get OSTimer Clk */
uint32_t CLOCK_GetOSTimerClkFreq(void)
{
    uint32_t freq = 0U;

