zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/drivers/fsl_clock.c
    switch ((PMC->OSTIMERr & PMC_OSTIMER_OSTIMERCLKSEL_MASK) >> PMC_OSTIMER_OSTIMERCLKSEL_SHIFT)
    {
        case OSTIMERCLKSEL_32768:
            freq = 32768;
            break;

        case OSTIMERCLKSEL_FRO_1MHz:
            freq = CLOCK_GetFro1MFreq();
            break;

        default:
            /* All other values mean NO_CLOCK */
            freq = 0;
            break;
    }

    return freq;
}

/*! @brief Enable the OSTIMER 32k clock.
 *  @return  Nothing
 */
void CLOCK_EnableOstimer32kClock(void)
{
    PMC->OSTIMERr |= PMC_OSTIMER_CLOCKENABLE_MASK;
}

/**
 * brief   Initialize the external osc clock to given frequency.
 * Crystal oscillator with an operating frequency of 32 MHz.
 * param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * return  returns success or fail status.
 */
status_t CLOCK_SetupExtClocking(uint32_t iFreq)
{
    if (iFreq != 32000000U)
    {
        return kStatus_Fail;
    }

    /* Enable 32MHz crystal. */
    POWER_PeripheralPowerOn(kPOWERCFG_BLE);
    SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_CLKIN_ENA(1);

    s_Ext_Clk_Freq = iFreq;
    return kStatus_Success;
}

void CLOCK_Select32kOscClkSrc(osc_32k_clock_source_t clockSrc)
{
    uint32_t reg = PMC->RTCOSC32K & ~PMC_RTCOSC32K_SEL_MASK;
    if (clockSrc == kCLOCK_Osc32kClockSrc_FRO || clockSrc == kCLOCK_Osc32kClockSrc_XTAL)
    {
        PMC->RTCOSC32K = reg | PMC_RTCOSC32K_SEL(clockSrc);
    }
}

/* Set PLU CLKIN Clk */
/**
 * brief   Initialize the PLU CLKIN clock to given frequency.
 * param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * return  returns success or fail status.
 */
status_t CLOCK_SetupPLUClkInClocking(uint32_t iFreq)
{
    s_PLU_ClkIn_Freq = iFreq;
    return kStatus_Success;
}

/* Get PLU CLKIN Clk */
/*! brief  Return Frequency of PLU CLKIN Clock
 *  return Frequency of PLU CLKIN Clock
 */
uint32_t CLOCK_GetPLUClkInFreq(void)
{
    return s_PLU_ClkIn_Freq;
}
